app/controllers/cart_controller.rb

    def create # current_user ? current_user.name : 'Rails Store'
        cart = Cart.find_or_create_by(user: current_user)
        product = Product.find(params[:product_id])
        item = Item.find_or_create_by(product: product, cart: cart)
        item.quanity ? item.update(quanity: (item.quanity + params[:quantiy].to_i)) : item.update(quanity: params[:quantiy])
---
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2020-12-08 12:18:59.170235"], ["updated_at", "2020-12-08 12:18:59.170235"], ["user_id", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "items" ("cart_id", "product_id", "created_at", "updated_at", "quanity") VALUES (?, ?, ?, ?, ?)  [["cart_id", 1], ["product_id", 18], ["created_at", "2020-12-08 13:47:53.358649"], ["updated_at", "2020-12-08 13:47:53.358649"], ["quanity", 4]]
SELECT  "items".* FROM "items" WHERE "items"."product_id" = ? AND "items"."cart_id" = ? LIMIT ?  [["product_id", 5], ["cart_id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "total_price" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["total_price", 0.0], ["updated_at", "2020-12-15 10:41:39.625533"], ["id", 1]]
UPDATE "items" SET "quanity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["quanity", nil], ["updated_at", "2020-12-09 21:13:55.987368"], ["id", 14]]

    def show
        @cart = Cart.find_or_create_by(user: current_user)
        @items = Item.where(cart: @cart)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?  [["cart_id", 1]]

    def update
        cart = Cart.find_or_create_by(user: current_user)
        product = Product.find(params[:product_id])
        item = Item.find_or_create_by(product: product, cart: cart)

        if item_params[:quanity].to_i < 1
            item.destroy
            update_total_price()
        else
            item.update(item_params)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."product_id" = ? AND "items"."cart_id" = ? LIMIT ?  [["product_id", 5], ["cart_id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 16]]
UPDATE "carts" SET "total_price" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["total_price", 168.0], ["updated_at", "2020-12-15 07:28:26.269498"], ["id", 1]]
UPDATE "items" SET "quanity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["quanity", 2], ["updated_at", "2020-12-15 07:50:22.420203"], ["id", 19]]

    def update_total_price
        cart = Cart.find_or_create_by(user: current_user)
        items = Item.where(cart: cart)
        total = 0

        items.each do |i|
            total += (i.product.price.to_i * i.quanity.to_i)
        end

        cart.update(total_price: total.to_i)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?  [["cart_id", 1]]
UPDATE "carts" SET "total_price" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["total_price", -30.0], ["updated_at", "2020-12-15 07:55:22.997050"], ["id", 1]]