app/controllers/cart_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."product_id" = ? AND "items"."cart_id" = ? AND "items"."quanity" IS NULL LIMIT ?  [["product_id", 14], ["cart_id", 1], ["LIMIT", 1]]
---
    def create
        cart = Cart.find_or_create_by(user: current_user)
        product = Product.find(params[:product_id])
        item = Item.find_or_create_by(product: product, cart: cart, quanity: params[:quanity])