app/controllers/products_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ? ORDER BY "products"."price" ASC  [["category_id", 8]]
---
    def index
        @category = Category.find(params[:category_id])
        @products = @category.products.order(:price)