app/models/user.rb

  def self.setup()
    Cart.create(user_id: (self.id))
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "provider", "uid", "name", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def self.new_with_session(params, session)
    super.tap do |user|
      if data = session["devise.github"] && session["devise.github_data"]["extra"]["raw_info"]
        user.email = data["email"] if user.email.blank?
      end
      if data = session["devise.google_oauth2"] && session["devise.google_oauth2_data"]["extra"]["raw_info"]
        user.email = data["email"] if user.email.blank?
      end
      if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
        user.email = data["email"] if user.email.blank?
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bryce.boddy@gmail.com"], ["LIMIT", 1]]

  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "102736895012197"], ["LIMIT", 1]]